//横方向の長さ
var stageWidth = new Array();
//縦方向の長さ
var stageHeight = new Array();
//盤面情報
var setStages = new Array();
//ヒント
var stageHint = new Array();
//ブロックの推定必要数
var requiredBlock = new Array();
//ステージ数
countBoard = 18;

//ステージ0
stageWidth[0] = 3;
stageHeight[0] = 1;
setStages[0] = [ [ 5, 1, 3] ];
stageHint[0] = "前に進んで星を取ろう!"
requiredBlock[0] = 3;

//ステージ1
stageWidth[1] = 3;
stageHeight[1] = 3;
setStages[1] = [ [ 0, 0, 3]
				,[ 0, 0, 3]
				,[ 1, 1,21] ];
stageHint[1] = "右にある星を全て取ろう!\nそのためにまず右を向こう!"
requiredBlock[1] = 4;

//ステージ2
stageWidth[2] = 5;
stageHeight[2] = 5;
setStages[2] = [ [ 0, 0, 3, 0, 0]
				,[ 0, 0, 1, 0, 0]
				,[ 3, 1, 5, 1, 3]
				,[ 0, 0, 1, 0, 0]
				,[ 0, 0, 3, 0, 0] ];
stageHint[2] = "繰り返し動作をしよう!\n「繰り返し動作」ブロックを使うと\n「動作開始」に戻るよ!"
requiredBlock[2] = 8;

//ステージ3
stageWidth[3] = 5;
stageHeight[3] = 5;
setStages[3] = [ [ 5, 1, 1, 3, 1]
				,[ 0, 0, 0, 1, 0]
				,[ 1, 3, 0, 1, 0]
				,[ 1, 0, 0, 1, 1]
				,[ 3, 1, 1, 3, 1] ];
stageHint[3] = "緑色のブロックで右方向を確認をしよう!\n基本は「確認して1歩進む」!\n進めるならブロックの右\n進めないならブロックの下を読むよ!"
requiredBlock[3] = 6;

//ステージ4
stageWidth[4] = 4;
stageHeight[4] = 4;
setStages[4] = [ [29, 0, 3, 1]
				,[ 1, 0, 0, 1]
				,[ 1, 0, 0, 1]
				,[ 1, 3, 0,13] ];
stageHint[4] = "2つのキャラクターを動かそう!\nどっちも同じ動きをするよ!"
requiredBlock[4] = 6;

//ステージ5
stageWidth[5] = 6;
stageHeight[5] = 6;
setStages[5] = [ [ 5, 1, 1, 1, 1, 1]
        	   , [ 0, 0, 0, 0, 3, 0]
        	   , [ 5, 1, 0, 3, 0, 0]
        	   , [ 3, 0, 1, 1, 1,21]
        	   , [ 0, 3, 0, 0, 0, 0]
        	   , [ 1, 1, 1, 1, 1,21] ];
stageHint[5] = "星を1つずつ取ろう!\n右に星がある時に取りにいこう!";
requiredBlock[5] = 6;

//ステージ6
stageWidth[6] = 5;
stageHeight[6] = 5;
setStages[6] = [ [ 3, 0, 0, 0,29]
				,[ 1, 0, 0, 3, 1]
				,[ 1, 3, 0, 0, 1]
				,[ 1, 0, 0, 3, 1]
				,[13, 0, 0, 0, 3] ];
stageHint[6] = "関数を使って星を取ろう!\n右に星がある時に取ってこよう!"
requiredBlock[6] = 10;

//ステージ7
stageWidth[7] = 9;
stageHeight[7] = 4;
setStages[7] = [ [ 0, 0, 1, 0, 1, 1, 1, 1, 1]
				,[ 0, 0, 3, 1, 3, 3, 3, 3, 3]
				,[ 0, 0, 1, 0, 1, 1, 1, 1, 1]
				,[ 5, 1, 3, 1, 0, 0, 0, 0, 0] ];
stageHint[7] = "左に曲がって右に曲がって\n最後は前進!"
requiredBlock[7] = 12;

//ステージ8
stageWidth[8] = 7;
stageHeight[8] = 7;
setStages[8] = [ [ 1, 1, 1, 1, 3, 1, 3]
				,[ 5, 1, 1, 1, 3, 0, 3]
				,[ 1, 0, 1, 1, 3, 1, 3]
				,[ 3, 3, 3, 1, 1, 1, 3]
				,[ 1, 3, 1, 1, 1, 1, 0]
				,[ 0, 3, 1, 3, 3, 3, 3]
				,[ 1, 3, 1, 1, 0, 1, 1] ];
stageHint[8] = "まずは前進!\n左に行ったら回れ右!"
requiredBlock[8] = 12;

//ステージ9
stageWidth[9] = 7;
stageHeight[9] = 7;
setStages[9] = [ [ 1, 1, 1, 0, 0,29, 0]
				,[ 1, 0, 1, 1, 0, 1, 0]
				,[ 1, 1, 0, 1, 0, 1, 1]
				,[ 0, 1, 0, 1, 0, 0, 1]
				,[ 1, 1, 0, 1, 1, 1, 1]
				,[ 1, 0, 0, 0, 0, 0, 0]
				,[ 1, 1, 1, 1, 1, 1, 3] ];
stageHint[9] = "チュートリアル最後のステージ!\n曲がる所は曲がって先に進もう!"
requiredBlock[9] = 9;


//ステージ10
stageWidth[10] = 7;
stageHeight[10] = 7;
setStages[10] = [ [ 0, 0, 1, 3, 1, 0, 0]
        	   , [ 0, 1, 1, 1, 1, 1, 0]
        	   , [ 1, 1, 3, 1, 3, 1, 1]
        	   , [ 5, 1, 1, 1, 1, 1, 3]
        	   , [ 1, 1, 3, 1, 3, 1, 1]
        	   , [ 0, 1, 1, 1, 1, 1, 0]
        	   , [ 0, 0, 1, 3, 1, 0, 0] ];
stageHint[10] = "どの順番で星を取るか考えてみよう!"
requiredBlock[10] = 7;

//ステージ11
stageWidth[11] = 7;
stageHeight[11] = 7;
setStages[11] = [ [ 0, 5, 3, 3, 3, 3, 1]
        	   , [29, 0, 0, 0, 0, 0, 3]
        	   , [ 3, 0, 1, 3, 3, 3, 1]
        	   , [ 3, 0, 3, 0, 0, 0, 0]
        	   , [ 3, 0, 3, 1, 1, 1, 0]
        	   , [ 1, 3, 3, 3, 3, 3, 3]
        	   , [ 1, 0, 3, 1, 1, 1, 0] ];
stageHint[11] = "最後はひたすら前進!"
requiredBlock[11] = 12;

//ステージ12
stageWidth[12] = 9;
stageHeight[12] = 8;
setStages[12] = [ [ 5, 1, 1, 1, 1, 1, 1, 1, 3]
        	   , [ 0, 0, 0, 0, 0, 1, 0, 0, 0]
        	   , [ 3, 1, 1, 1, 1, 1, 1, 1, 3]
        	   , [ 0, 1, 0, 0, 0, 0, 0, 0, 0]
        	   , [ 3, 1, 1, 1, 1, 1, 1, 1, 3]
        	   , [ 0, 0, 0, 0, 0, 0, 0, 1, 0]
        	   , [ 3, 1, 1, 1, 1, 1, 1, 1, 3]
        	   , [ 0, 0, 0, 3, 0, 0, 0, 0, 0] ];
stageHint[12] = "1列ずつ星を取る?\n1つ取ったら先に進む?"
requiredBlock[12] = 9;

//ステージ13
stageWidth[13] = 11;
stageHeight[13] = 9;
setStages[13] = [ [ 0, 3, 0, 0, 0, 0, 0, 0, 0, 3, 0]
        	   , [ 0, 1, 0, 3, 1, 3, 1, 3, 0, 1, 0]
        	   , [ 3, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0]
        	   , [ 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0]
        	   , [ 0, 3, 0, 3, 0, 3, 0, 3, 1, 1,21]
        	   , [ 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0]
        	   , [ 3, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0]
        	   , [ 0, 1, 0, 3, 1, 3, 1, 3, 0, 1, 0]
        	   , [ 0, 3, 0, 0, 0, 0, 0, 0, 0, 3, 0] ];
stageHint[13] = "草"
requiredBlock[13] = 31;

//ステージ14
stageWidth[14] = 11;
stageHeight[14] = 9;
setStages[14] = [ [ 3, 0, 3, 0, 0, 3, 0, 3, 3, 3, 0]
        	   , [ 5, 1, 1, 1, 1, 1, 1, 1, 0, 1, 3]
        	   , [ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
        	   , [ 1, 1, 0, 1, 0, 1, 3, 1, 0, 1, 0]
        	   , [ 5, 1, 3, 1, 3, 1, 0, 1, 3, 1, 3]
        	   , [ 1, 1, 0, 1, 0, 1, 3, 1, 0, 1, 0]
        	   , [ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
        	   , [ 5, 3, 3, 1, 3, 3, 3, 1, 0, 3, 3]
        	   , [ 1, 1, 3, 3, 3, 1, 3, 3, 3, 3, 0] ];
stageHint[14] = "各キャラクターに異なる動作をさせる\nその方法とは!?"
requiredBlock[14] = 48;

//ステージ15
stageWidth[15] = 11;
stageHeight[15] = 9;
setStages[15] = [[ 0,29, 0, 0,29, 0, 0,29, 0, 0,29]
        	   , [ 0, 1, 1, 1, 1, 0, 3, 1, 1, 1, 1]
        	   , [ 5, 1, 0, 0, 3, 1, 1, 0, 0, 0, 1]
        	   , [ 0, 3, 1, 3, 1, 0, 1, 3, 1, 1, 3]
        	   , [ 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0]
        	   , [ 5, 1, 3, 0, 1, 0, 1, 0, 0, 1, 0]
        	   , [ 0, 0, 1, 1, 3, 1, 3, 1, 3, 1, 3]
        	   , [ 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1]
        	   , [ 5, 1, 3, 0, 0, 3, 1, 1, 3, 0, 3] ];
stageHint[15] = "適当なステージには適当なプログラムを?\n試行錯誤してみよう!"
requiredBlock[15] = 13;

//ステージ16
stageWidth[16] = 5;
stageHeight[16] = 5;
setStages[16] = [[ 3, 3, 3, 3, 3]
        	   , [ 3, 3, 3, 3, 3]
        	   , [ 3, 3, 5, 3, 3]
        	   , [ 3, 3, 3, 3, 3]
        	   , [ 3, 3, 3, 3, 3] ];
stageHint[16] = "ボーナスステージ!\n全部取ろう!"
requiredBlock[16] = 20;

//ステージ17
stageWidth[17] = 9;
stageHeight[17] = 9;
setStages[17] = [[ 0, 0, 3, 3, 3, 3, 3, 0, 0]
        	   , [ 0, 0, 0, 3, 3, 3, 0, 0, 0]
        	   , [ 3, 0, 3, 3, 3, 3, 3, 0, 3]
        	   , [ 3, 3, 3, 3, 3, 3, 3, 3, 3]
        	   , [ 3, 3, 3, 3, 5, 3, 3, 3, 3]
        	   , [ 3, 3, 3, 3, 3, 3, 3, 3, 3]
        	   , [ 3, 0, 3, 3, 3, 3, 3, 0, 3]
        	   , [ 0, 0, 0, 3, 3, 3, 0, 0, 0]
        	   , [ 0, 0, 3, 3, 3, 3, 3, 0, 0] ];
stageHint[17] = "!!!ボーナスステージ!!!\n!!!全部取れ!!!"
requiredBlock[17] = 46;