//横方向の長さ
var stageWidth = new Array();
//縦方向の長さ
var stageHeight = new Array();
//盤面情報
var setStages = new Array();
//ヒント
var stageHint = new Array();
//ステージ数
countBoard = 15;

//ステージ0
stageWidth[0] = 3;
stageHeight[0] = 1;
setStages[0] = [ [ 5, 1, 3] ];
stageHint[0] = "前に進んで星を取ろう!"

//ステージ1
stageWidth[1] = 3;
stageHeight[1] = 3;
setStages[1] = [ [ 0, 0, 3]
				,[ 0, 0, 3]
				,[ 1, 1,21] ];
stageHint[1] = "右にある星を全て取ろう!\nそのためにまず右を向こう!"

//ステージ2
stageWidth[2] = 5;
stageHeight[2] = 5;
setStages[2] = [ [ 0, 0, 3, 0, 0]
				,[ 0, 0, 1, 0, 0]
				,[ 3, 1, 5, 1, 3]
				,[ 0, 0, 1, 0, 0]
				,[ 0, 0, 3, 0, 0] ];
stageHint[2] = "繰り返し動作をしよう!\n「繰り返し動作」ブロックを使うと\n「動作開始」に戻るよ!"

//ステージ3
stageWidth[3] = 5;
stageHeight[3] = 5;
setStages[3] = [ [ 5, 1, 1, 3, 1]
				,[ 0, 0, 0, 1, 0]
				,[ 0, 0, 0, 1, 0]
				,[ 3, 1, 1, 3, 1]
				,[ 0, 0, 0, 1, 0] ];
stageHint[3] = "緑色のブロックで右方向を確認をしよう!\n進めるならブロックの右\n進めないならブロックの下を読むよ!"

//ステージ4
stageWidth[4] = 4;
stageHeight[4] = 4;
setStages[4] = [ [29, 0, 3, 1]
				,[ 1, 0, 0, 1]
				,[ 1, 0, 0, 1]
				,[ 1, 3, 0,13] ];
stageHint[4] = "2つのキャラクターを動かそう!\nどっちも同じ動きをするよ!"

//ステージ5
stageWidth[5] = 6;
stageHeight[5] = 6;
setStages[5] = [ [ 5, 1, 1, 1, 1, 1]
        	   , [ 0, 0, 0, 0, 3, 0]
        	   , [ 5, 1, 0, 3, 0, 0]
        	   , [ 3, 0, 1, 1, 1,21]
        	   , [ 0, 3, 0, 0, 0, 0]
        	   , [ 1, 1, 1, 1, 1,21] ];
stageHint[5] = "星を1つずつ取ろう!\n右に星がある時に取りにいこう!";

//ステージ6
stageWidth[6] = 5;
stageHeight[6] = 5;
setStages[6] = [ [ 3, 0, 0, 0,29]
				,[ 1, 0, 0, 3, 1]
				,[ 1, 3, 0, 0, 1]
				,[ 1, 0, 0, 3, 1]
				,[13, 0, 0, 0, 3] ];
stageHint[6] = "関数を使って星を取ろう!\n右に星がある時に取ってこよう!"

//ステージ7
stageWidth[7] = 9;
stageHeight[7] = 4;
setStages[7] = [ [ 3, 1, 3, 0, 0, 0, 3, 1, 3]
				,[ 1, 0, 1, 1, 5, 1, 1, 0, 1]
				,[ 1, 0, 1, 1, 1, 1, 1, 0, 1]
				,[ 3, 1, 3, 0, 0, 0, 3, 1, 3] ];
stageHint[7] = "まっすぐ進んで星を取る!\nそしたら反対の星も取る!"

//ステージ8
stageWidth[8] = 7;
stageHeight[8] = 7;
setStages[8] = [ [ 1, 1, 1, 1, 3, 1, 3]
				,[ 5, 1, 1, 1, 3, 0, 3]
				,[ 1, 0, 1, 1, 3, 1, 3]
				,[ 3, 3, 3, 1, 1, 1, 3]
				,[ 1, 3, 1, 1, 1, 1, 0]
				,[ 0, 3, 1, 3, 3, 3, 3]
				,[ 1, 3, 1, 1, 0, 1, 1] ];
stageHint[8] = "まずは前進!\n左に行ったら回れ右!"

//ステージ9
stageWidth[9] = 7;
stageHeight[9] = 7;
setStages[9] = [ [ 1, 1, 1, 0, 0,29, 0]
				,[ 1, 0, 1, 1, 0, 1, 0]
				,[ 1, 1, 0, 1, 0, 1, 1]
				,[ 0, 1, 0, 1, 0, 0, 1]
				,[ 1, 1, 0, 1, 1, 1, 1]
				,[ 1, 0, 0, 0, 0, 0, 0]
				,[ 1, 1, 1, 1, 1, 1, 3] ];
stageHint[9] = "チュートリアル最後のステージ!\n曲がる所は曲がって先に進もう!"


//ステージ10
stageWidth[10] = 7;
stageHeight[10] = 7;
setStages[10] = [ [ 0, 0, 1, 3, 1, 0, 0]
        	   , [ 0, 1, 1, 1, 1, 1, 0]
        	   , [ 1, 1, 3, 1, 3, 1, 1]
        	   , [ 5, 1, 1, 1, 1, 1, 3]
        	   , [ 1, 1, 3, 1, 3, 1, 1]
        	   , [ 0, 1, 1, 1, 1, 1, 0]
        	   , [ 0, 0, 1, 3, 1, 0, 0] ];
stageHint[10] = "どの順番で星を取るか考えてみよう!"

//ステージ11
stageWidth[11] = 7;
stageHeight[11] = 7;
setStages[11] = [ [ 0, 5, 3, 3, 3, 3, 1]
        	   , [29, 0, 0, 0, 0, 0, 3]
        	   , [ 3, 0, 1, 3, 3, 3, 1]
        	   , [ 3, 0, 3, 0, 0, 0, 0]
        	   , [ 3, 0, 3, 1, 1, 1, 0]
        	   , [ 1, 3, 3, 3, 3, 3, 3]
        	   , [ 1, 0, 3, 1, 1, 1, 0] ];
stageHint[11] = "最後はひたすら前進!"

//ステージ12
stageWidth[12] = 9;
stageHeight[12] = 8;
setStages[12] = [ [ 5, 1, 1, 1, 1, 1, 1, 1, 3]
        	   , [ 0, 0, 0, 0, 0, 1, 0, 0, 0]
        	   , [ 3, 1, 1, 1, 1, 1, 1, 1, 3]
        	   , [ 0, 1, 0, 0, 0, 0, 0, 0, 0]
        	   , [ 3, 1, 1, 1, 1, 1, 1, 1, 3]
        	   , [ 0, 0, 0, 0, 0, 0, 0, 1, 0]
        	   , [ 3, 1, 1, 1, 1, 1, 1, 1, 3]
        	   , [ 0, 0, 0, 3, 0, 0, 0, 0, 0] ];
stageHint[12] = "1列ずつ星を取る?\n1つ取ったら先に進む?"

//ステージ13
stageWidth[13] = 11;
stageHeight[13] = 9;
setStages[13] = [ [ 0, 3, 0, 0, 0, 0, 0, 0, 0, 3, 0]
        	   , [ 0, 1, 0, 3, 1, 3, 1, 3, 0, 1, 0]
        	   , [ 3, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0]
        	   , [ 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0]
        	   , [ 0, 3, 0, 3, 0, 3, 0, 3, 1, 1,21]
        	   , [ 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0]
        	   , [ 3, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0]
        	   , [ 0, 1, 0, 3, 1, 3, 1, 3, 0, 1, 0]
        	   , [ 0, 3, 0, 0, 0, 0, 0, 0, 0, 3, 0] ];
stageHint[13] = "草"

//ステージ14
stageWidth[14] = 11;
stageHeight[14] = 9;
setStages[14] = [ [ 3, 0, 3, 0, 0, 3, 0, 3, 3, 3, 0]
        	   , [ 5, 1, 1, 1, 1, 1, 1, 1, 0, 1, 3]
        	   , [ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
        	   , [ 1, 1, 0, 1, 0, 1, 3, 1, 0, 1, 0]
        	   , [ 5, 1, 3, 1, 3, 1, 0, 1, 3, 1, 3]
        	   , [ 1, 1, 0, 1, 0, 1, 3, 1, 0, 1, 0]
        	   , [ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
        	   , [ 5, 3, 3, 1, 3, 3, 3, 1, 0, 3, 3]
        	   , [ 1, 1, 3, 3, 3, 1, 3, 3, 3, 3, 0] ];
stageHint[14] = "各キャラクターに異なる動作をさせる\nその方法とは!?"